# NonGenericAnnotationsOutsideLegend Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..NonGenericAnnotationsOutsideLegend Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Only Generic Annotations may be copied between Legends and other Views
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NonGenericAnnotationsOutsideLegend { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NonGenericAnnotationsOutsideLegend As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NonGenericAnnotationsOutsideLegend {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace